---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ShowDataDescription
source: html/ffa8fc7d-073b-78f8-aee7-3e871681b795.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ShowDataDescription Property

If true, data description is shown in the legend.

## Syntax (C#)
```csharp
public bool ShowDataDescription { get; set; }
```